import LandingSection from '@/components/landing-section';
import {
  Accordion,
  AccordionContent,
  AccordionItem,
  AccordionTrigger,
} from '@/components/ui/accordion';

const data = [
  {
    id: '1',
    title: 'چگونه می‌توانم پروفایل ایجاد کنم و رزومه خود را بارگذاری کنم؟',
    content: `ایجاد پروفایل بسیار ساده است! روی دکمه "ثبت نام" در بالای صفحه، سمت چپ کلیک کنید. اطلاعات مورد نیاز را پر کنید تا حساب کاربری خود را ایجاد کنید. پس از ایجاد حساب، می‌توانید وارد شوید و به بخش "پروفایل من" بروید تا رزومه خود را بارگذاری کرده و جزئیات پروفایل خود را تکمیل کنید.`,
  },
  {
    id: '2',
    title: 'چگونه می‌توانم برای یک موقعیت کارآموزی درخواست بدهم؟',
    content: `برای ایجاد درخواست به یک موقعیت کارآموزی، وارد حساب کاربری خود شوید و با استفاده از گزینه‌های جستجو و فیلتر، موقعیت‌های موجود را جستجو کنید. وقتی موقعیتی که به آن علاقه دارید را پیدا کردید، روی دکمه "ایجاد درخواست" کلیک کنید. ممکن است بسته به موقعیت شغلی لازم باشد تست های مورد نیاز را انجام دهید و رزومه خود را ارسال کنید. درخواست شما مستقیماً به شرکت مربوطه ارسال خواهد شد.`,
  },
  {
    id: '3',
    title: 'چگونه می‌توانم وضعیت درخواست‌های کارآموزی خود را پیگیری کنم؟',
    content: `شما می‌توانید وضعیت درخواست‌های خود را با ورود به حساب کاربری و رفتن به بخش "درخواست‌های من" پیگیری کنید. در اینجا، فهرستی از تمامی موقعیت‌هایی که برای آن‌ها درخواست داده‌اید به همراه وضعیت فعلی آن‌ها (مانند در حال بررسی، مصاحبه تنظیم شده، تایید شده، رد شده) را مشاهده خواهید کرد.`,
  },
  {
    id: '4',
    title: 'الگوریتم تطبیق چگونه کار می‌کند تا کارآموزان را با موقعیت‌های مناسب متصل کند؟',
    content:
      'در آینده پلتفرم ما از یک الگوریتم تطبیق پیشرفته استفاده خواهد کرد که مهارت‌ها، صلاحیت‌ها و ترجیحات موجود در پروفایل جویای کار را با نیازها و جزئیات موقعیت‌های کارآموزی موجود تطبیق می‌دهد. این اطمینان حاصل خواهد شد که هم شرکت‌ها و هم کارآموزان بهترین تطبیق ممکن را بر اساس نیازها و پیشنهاداتشان پیدا کنند.',
  },
];

export default function FrequentlyAskedQuestions() {
  return (
    <LandingSection title="سوالات متداول">
      <Accordion type="single" collapsible className="mt-10 w-full space-y-4">
        {data.map((item) => (
          <AccordionItem key={item.id} value={item.id}>
            <AccordionTrigger>{item.title}</AccordionTrigger>
            <AccordionContent>{item.content}</AccordionContent>
          </AccordionItem>
        ))}
      </Accordion>
    </LandingSection>
  );
}
