export const data = [
  {
    title: 'مقطع تحصیلی',
    key: 'education',
    searchable: false,
    options: [
      {
        id: '2',
        title: 'کارشناسی',
      },
      {
        id: '3',
        title: 'کارشناسی‌ارشد',
      },
      {
        id: '4',
        title: 'دکتری',
      },
    ],
  },
  {
    title: 'رشته تحصیلی',
    key: 'major',
    searchable: true,
    options: [
      {
        id: '1',
        title: 'MBA',
      },
      {
        id: '2',
        title: 'اقتصاد',
      },
      {
        id: '3',
        title: 'آمار',
      },
      {
        id: '4',
        title: 'حسابداری',
      },
      {
        id: '5',
        title: 'ریاضیات و کاربردها',
      },
      {
        id: '6',
        title: 'علوم کامپیوتر',
      },
      {
        id: '7',
        title: 'مدیریت اجرایی',
      },
      {
        id: '8',
        title: 'مدیریت بازاریابی',
      },
      {
        id: '9',
        title: 'مدیریت بازرگانی',
      },
      {
        id: '10',
        title: 'مدیریت تکنولوژی',
      },
      {
        id: '11',
        title: 'مدیریت دولتی',
      },
      {
        id: '12',
        title: 'مدیریت صنعتی',
      },
      {
        id: '13',
        title: 'مدیریت مالی',
      },
      {
        id: '14',
        title: 'مدیریت منابع انسانی',
      },
      {
        id: '15',
        title: 'مهندسی برق-الکترونیک',
      },
      {
        id: '16',
        title: 'مهندسی برق-قدرت',
      },
      {
        id: '17',
        title: 'مهندسی برق-کنترل',
      },
      {
        id: '18',
        title: 'مهندسی برق-مخابرات',
      },
      {
        id: '19',
        title: 'مهندسی برق-مخابرات-سیستم',
      },
      {
        id: '20',
        title: 'مهندسی برق-مخابرات-میدان',
      },
      {
        id: '21',
        title: 'مهندسی صنایع',
      },
      {
        id: '22',
        title: 'فناوری اطلاعات',
      },
      {
        id: '23',
        title: 'مهندسی کامپیوتر-سخت‌افزار',
      },
      {
        id: '24',
        title: 'مهندسی کامپیوتر-نرم‌افزار',
      },
      {
        id: '25',
        title: 'مهندسی کامپیوتر-هوش مصنوعی',
      },
      {
        id: '34',
        title: 'سایر رشته‌ها',
      },
      {
        id: '26',
        title: 'کارشناسی گرافیک-تصویر سازی',
      },
      {
        id: '27',
        title: 'کارشناسی گرافیک- چاپ و بسته بندی',
      },
      {
        id: '28',
        title: 'کارشناسی گرافیک-گرایش پوستر و نشانه',
      },
      {
        id: '29',
        title: 'کارشناسی حقوق',
      },
      {
        id: '30',
        title: 'مدیریت فناوری اطلاعات',
      },
      {
        id: '31',
        title: 'مهندسی مکانیک',
      },
      {
        id: '32',
        title: 'روابط عمومی',
      },
      {
        id: '33',
        title: 'روان‌شناسی',
      },
      {
        id: '36',
        title: 'روان‌شناسی صنعتی',
      },
      {
        id: '37',
        title: 'بهداشت حرفه‌ای',
      },
      {
        id: '38',
        title: 'ایمنی صنعتی',
      },
      {
        id: '39',
        title: 'HSE',
      },
      {
        id: '40',
        title: 'فناوری اطلاعات و ارتباطات',
      },
      {
        id: '41',
        title: 'مهندسی عمران',
      },
      {
        id: '42',
        title: 'مهندسی معماری',
      },
      {
        id: '44',
        title: 'علوم ارتباطات اجتماعی',
      },
      {
        id: '45',
        title: 'مدیریت',
      },
      {
        id: '47',
        title: 'علوم پایه',
      },
      {
        id: '35',
        title: 'کلیه رشته‌ها',
      },
      {
        id: '48',
        title: 'طراحی گرافیک',
      },
      {
        id: '49',
        title: 'هنر',
      },
      {
        id: '50',
        title: 'مهندسی مالی',
      },
      {
        id: '51',
        title: 'نقاشی',
      },
      {
        id: '52',
        title: 'تصویرسازی',
      },
      {
        id: '53',
        title: 'گرافیک',
      },
      {
        id: '43',
        title: 'روزنامه‌نگاری',
      },
      {
        id: '55',
        title: 'کارگردانی',
      },
      {
        id: '56',
        title: 'محیط زیست',
      },
      {
        id: '57',
        title: 'بهداشت حرفه‌ای و ایمنی',
      },
      {
        id: '58',
        title: 'ایمنی کار و حفاظت فنی',
      },
      {
        id: '54',
        title: 'علوم ارتباطات',
      },
      {
        id: '46',
        title: 'کلیه رشته‌های مهندسی',
      },
      {
        id: '59',
        title: 'زبان و ادبیات فارسی',
      },
    ],
  },
  {
    title: 'وضعیت نظام‌وظیفه',
    key: 'militaryStatus',
    searchable: false,
    options: [
      {
        id: '2',
        title: 'پایان خدمت',
      },
      {
        id: '3',
        title: 'معافیت تحصیلی',
      },
      {
        id: '4',
        title: 'معافیت دائم',
      },
    ],
  },
] as const;
