export const data = [
  {
    title: 'محل کارآموزی',
    key: 'location',
    searchable: true,
    options: [
      {
        id: '53041907-eaaa-49f9-94b8-ca040382255c',
        title: 'مرکز پژوهشی پارسا شریف',
      },
      {
        id: 'd821c7a8-586b-4429-ba05-7092a6272280',
        title: 'اداره کل نظارت و بازرسی همراه اول',
      },
      {
        id: '37e69ad4-e35b-420a-9de1-e47db719ffb3',
        title: 'همراه کسب و کارهای هوشمند (EBCOM)',
      },
      {
        id: 'f0ff56e9-5450-4500-b2ac-8cf5d4e68cd4',
        title: 'جیرینگ',
      },
      {
        id: '9bcc4cec-3d5e-42ce-ab82-40fea8973112',
        title: 'اداره کل حقوقی و رگولاتوری همراه اول',
      },
      {
        id: '50e2d3d0-565a-4864-b06b-69a8ae5cd51a',
        title: 'پیشتازان امن کاوی عماد',
      },
      {
        id: 'ba2440d6-481b-4510-8f90-3842a22bd405',
        title: 'حرکت اول',
      },
      {
        id: '4c9a29c9-4c8f-403f-9233-d58b3d3d21df',
        title: 'شرکت نویان',
      },
      {
        id: '74f46912-0b6a-4dda-be5a-cb0e407a600e',
        title: 'اداره کل ایمنی شبکه همراه اول',
      },
      {
        id: '9dd98061-7326-40eb-9687-bd6008f229d8',
        title: 'آکادمی همراه',
      },
      {
        id: '16cd5b4a-75db-4a5b-9840-fc9e85ffb0c9',
        title: 'اداره کل ارتباطات همراه اول',
      },
      {
        id: '75581d0a-7005-40c9-8d14-f3a158178207',
        title: 'پروژه موتور جستجوگر ذره‌بین',
      },
      {
        id: 'a13318df-11bd-4526-8483-95cddab861a4',
        title: 'روبیکا',
      },
      {
        id: 'f7fd4f3e-db3f-4732-b1b8-7d58148df218',
        title: 'معاونت مالی و تدارکاتی همراه اول',
      },
      {
        id: 'f1287d56-6b48-4d23-8ce2-f38a79d8b449',
        title: 'معاونت فنی و توسعه شبکه همراه اول',
      },
      {
        id: 'a72b15a0-1795-4141-8926-60c97598798a',
        title: 'شرکت ستاره اول',
      },
      {
        id: 'b149aa1c-192f-4924-9824-9d127e44a6fb',
        title: 'بومینو',
      },
      {
        id: '9081c3ba-0803-419c-adda-b5eceb36265e',
        title: 'مرکز تحقیق و توسعه همراه اول',
      },
      {
        id: 'de4ca3c4-b3d8-4fc1-9f6a-43ea48192e52',
        title: 'خانواده درسا',
      },
      {
        id: '4efeafbb-149d-4a30-95b8-8346772d7424',
        title: 'معاونت خدمات مشتریان همراه اول',
      },
      {
        id: '2909e582-d313-494d-bb64-fa831bf2e764',
        title: 'معاونت توسعه سازمان و سرمایه انسانی همراه اول',
      },
      {
        id: 'a6496b4e-2639-4952-9ffb-481cd81629fb',
        title:
          'معاونت فناوری اطلاعات همراه اول (اداره کل سیستم‌های پشتیبانی کسب و کار)',
      },
      {
        id: 'c432cf35-a7ae-4ee2-b3f7-239437ea7150',
        title: 'معاونت فنی و عملیات شبکه همراه اول',
      },
      {
        id: '80404ec1-bfb1-4090-82d8-a95594bca296',
        title: 'نقش اول کیفیت (NAK)',
      },
      {
        id: '7c8c176a-4ce3-4942-94f5-2d33fda8d828',
        title: 'معاونت راهبرد همراه اول',
      },
      {
        id: 'ca5eced9-7342-4f74-bdbb-b235b6f48add',
        title: 'زیست بوم مجازی درسا',
      },
      {
        id: 'e287473a-c37f-40ab-b59e-ab4d736777ed',
        title: 'شرکت سالارتل',
      },
      {
        id: 'c78e1870-ffc9-4278-a415-f8f1ae2f8d9a',
        title: 'شرکت یافتار پژوهان پیشتاز رایانش',
      },
      {
        id: 'e1e39f6a-4358-497a-b3d6-d5ca40c9937f',
        title: 'معاونت فناوری اطلاعات همراه اول',
      },
      {
        id: '7daae74f-0ca8-4ce4-9998-d84338db8a6c',
        title: 'شرکت ارتباطات مبین نت',
      },
      {
        id: '398996d3-5147-454c-91bd-8e04930aa2cd',
        title: 'شرکت افرانت',
      },
      {
        id: '63ae9778-d9c0-437b-ae98-4bf272152c6f',
        title: 'معاونت بازاریابی و فروش همراه اول',
      },
      {
        id: '1d6dba29-c57c-4081-a244-e96039789202',
        title: 'شرکت امن افزار گستر شریف',
      },
    ],
  },
  {
    title: 'مقطع تحصیلی',
    key: 'education',
    searchable: false,
    options: [
      {
        id: '2',
        title: 'کارشناسی',
      },
      {
        id: '3',
        title: 'کارشناسی‌ارشد',
      },
      {
        id: '4',
        title: 'دکتری',
      },
    ],
  },
  {
    title: 'رشته تحصیلی',
    key: 'major',
    searchable: true,
    options: [
      {
        id: '1',
        title: 'MBA',
      },
      {
        id: '2',
        title: 'اقتصاد',
      },
      {
        id: '3',
        title: 'آمار',
      },
      {
        id: '4',
        title: 'حسابداری',
      },
      {
        id: '5',
        title: 'ریاضیات و کاربردها',
      },
      {
        id: '6',
        title: 'علوم کامپیوتر',
      },
      {
        id: '7',
        title: 'مدیریت اجرایی',
      },
      {
        id: '8',
        title: 'مدیریت بازاریابی',
      },
      {
        id: '9',
        title: 'مدیریت بازرگانی',
      },
      {
        id: '10',
        title: 'مدیریت تکنولوژی',
      },
      {
        id: '11',
        title: 'مدیریت دولتی',
      },
      {
        id: '12',
        title: 'مدیریت صنعتی',
      },
      {
        id: '13',
        title: 'مدیریت مالی',
      },
      {
        id: '14',
        title: 'مدیریت منابع انسانی',
      },
      {
        id: '15',
        title: 'مهندسی برق-الکترونیک',
      },
      {
        id: '16',
        title: 'مهندسی برق-قدرت',
      },
      {
        id: '17',
        title: 'مهندسی برق-کنترل',
      },
      {
        id: '18',
        title: 'مهندسی برق-مخابرات',
      },
      {
        id: '19',
        title: 'مهندسی برق-مخابرات-سیستم',
      },
      {
        id: '20',
        title: 'مهندسی برق-مخابرات-میدان',
      },
      {
        id: '21',
        title: 'مهندسی صنایع',
      },
      {
        id: '22',
        title: 'فناوری اطلاعات',
      },
      {
        id: '23',
        title: 'مهندسی کامپیوتر-سخت‌افزار',
      },
      {
        id: '24',
        title: 'مهندسی کامپیوتر-نرم‌افزار',
      },
      {
        id: '25',
        title: 'مهندسی کامپیوتر-هوش مصنوعی',
      },
      {
        id: '34',
        title: 'سایر رشته‌ها',
      },
      {
        id: '26',
        title: 'کارشناسی گرافیک-تصویر سازی',
      },
      {
        id: '27',
        title: 'کارشناسی گرافیک- چاپ و بسته بندی',
      },
      {
        id: '28',
        title: 'کارشناسی گرافیک-گرایش پوستر و نشانه',
      },
      {
        id: '29',
        title: 'کارشناسی حقوق',
      },
      {
        id: '30',
        title: 'مدیریت فناوری اطلاعات',
      },
      {
        id: '31',
        title: 'مهندسی مکانیک',
      },
      {
        id: '32',
        title: 'روابط عمومی',
      },
      {
        id: '33',
        title: 'روان‌شناسی',
      },
      {
        id: '36',
        title: 'روان‌شناسی صنعتی',
      },
      {
        id: '37',
        title: 'بهداشت حرفه‌ای',
      },
      {
        id: '38',
        title: 'ایمنی صنعتی',
      },
      {
        id: '39',
        title: 'HSE',
      },
      {
        id: '40',
        title: 'فناوری اطلاعات و ارتباطات',
      },
      {
        id: '41',
        title: 'مهندسی عمران',
      },
      {
        id: '42',
        title: 'مهندسی معماری',
      },
      {
        id: '44',
        title: 'علوم ارتباطات اجتماعی',
      },
      {
        id: '45',
        title: 'مدیریت',
      },
      {
        id: '47',
        title: 'علوم پایه',
      },
      {
        id: '35',
        title: 'کلیه رشته‌ها',
      },
      {
        id: '48',
        title: 'طراحی گرافیک',
      },
      {
        id: '49',
        title: 'هنر',
      },
      {
        id: '50',
        title: 'مهندسی مالی',
      },
      {
        id: '51',
        title: 'نقاشی',
      },
      {
        id: '52',
        title: 'تصویرسازی',
      },
      {
        id: '53',
        title: 'گرافیک',
      },
      {
        id: '43',
        title: 'روزنامه‌نگاری',
      },
      {
        id: '55',
        title: 'کارگردانی',
      },
      {
        id: '56',
        title: 'محیط زیست',
      },
      {
        id: '57',
        title: 'بهداشت حرفه‌ای و ایمنی',
      },
      {
        id: '58',
        title: 'ایمنی کار و حفاظت فنی',
      },
      {
        id: '54',
        title: 'علوم ارتباطات',
      },
      {
        id: '46',
        title: 'کلیه رشته‌های مهندسی',
      },
      {
        id: '59',
        title: 'زبان و ادبیات فارسی',
      },
    ],
  },
  {
    title: 'وضعیت نظام‌وظیفه',
    key: 'militaryStatus',
    searchable: false,
    options: [
      {
        id: '2',
        title: 'پایان خدمت',
      },
      {
        id: '3',
        title: 'معافیت تحصیلی',
      },
      {
        id: '4',
        title: 'معافیت دائم',
      },
    ],
  },
] as const;
