import type { Company } from '@/types/company';
import type { Job } from '@/types/jobs';

export const companies: Company[] = [
  {
    id: '112',
    name: 'ایرانسل',
    aboutUs:
      'از زمان دریافت مجوز ارائه خدمات ارتباطات راه دور در سال1383، به عنوان شرکت نوآور و پویای ایران، با هدف ارائه خدماتی در سطح جهانی، با قدرت گام برداشته‌ایم و در تجهیز مشترکان خود با سریع‌ترین و گسترده‌ترین شبکه اینترنت کشور پیشگام بوده‌ایم. اولین شبکهTD-LTEو اولین شبکه 4G/LTE در ایران توسط ایرانسل راه‌اندازی شد تا تجربه اینترنت همراه و ثابت را برای ایرانیان متحول کند. ما با اتصال بیش از 45 میلیون نفر در ایران تا امروز، در ارائه دنیایی از خدمات دیجیتالی جدید و جسورانه به مشتریان خود پیشرو بوده‌ایم',
    city: 'تهران',
    website: 'https://irancell.ir/',
    image: '/companies/irancell.webp',
  },
  {
    id: '113',
    name: 'اسنپ فود',
    aboutUs:
      'اسنپ‌فود اولین و بزرگترین سامانه سفارش آنلاین غذا در ایران است. زودفود که در سال 1388 تاسیس شد، پس از ادغام به بدوفود و پیوستن به گروه اسنپ، کار خود را با نام اسنپ‌فود ادامه داد. اسنپ‌فود با ارائه سرویس‌ها و ویژگی‌های متنوع، زندگی را ساده‌تر کرده است. سفارش آنلاین غذا و شیرینی و خرید از سوپرمارکت تنها با چند کلیک امکان‌پذیر شده است. اسنپ‌فود طیف وسیعی از امکانات و سرویس‌ها را فراهم کرده است. در حال حاضر، علاوه بر رستوران‌ها، امکان سفارش آنلاین از شیرینی فروشی‌ها، کافه‌ها، سوپرمارکت‌ها و نانوایی‌ها هم فراهم شده است. منوهای به روز و عکس دار، تخفیف‌های جذاب روزانه، دلیوری اختصاصی اسنپ‌فود، اکسپرس، و تیم پشتیبانی قوی تنها تعدادی اندک از ویژگی‌های اسنپ‌فود هستند. اسنپفود با ارائه سرویس‌ها و ویژگیهای جدید در زمینه تجارت الکترونیک حوزه غذا، روز به روز بیشتر پیشرفت می‌کند و در حوزه کاری خود پیشرو است.',
    city: 'تهران',
    website: 'https://snappfood.ir/',
    image: '/companies/snappfood.webp',
  },
  {
    id: '114',
    name: 'اسنپ',
    aboutUs:
      'اسنپ محصولی ایرانی است که از تیمی خلاق، جوان و تحصیل‌کرده قدرت می‌گیرد و در تلاش است تا صنعت فناوری اطلاعات و ارتباطات را به زندگی روزمره جامعه پیوند بزند. اهداف بزرگی در سر داریم و بلند پروازیم. قصد داریم اسنپ را به بهترین راهکار برای سفرهای درون‌شهری ایران تبدیل کنیم و در این راه به کمک افراد خلاق، سخت‌کوش و بلندپرواز احتیاج داریم. اگر چنین خصوصیاتی دارید خوشحال می‌شویم که رزومه خود را برای‌مان ارسال کنید.',
    city: 'تهران',
    website: 'https://snapp.ir/',
    image: '/companies/snapp.webp',
  },
  {
    id: '115',
    name: 'دیجیکالا',
    aboutUs:
      'ما در دیجی‌کالا به عنوان شرکتی که در حوزه تجارت الکترونیک فعالیت می‌کنه، به دنبال تحقق رویای «لبخندی برای همه ایران» هستیم. در همین راستا، با بهره‌گیری از فناوری‌های روز دنیا و توسعه مداوم سرویس‌های مبتنی بر تکنولوژی، ارزش‌های‌ خودمون رو در مشتری‌محوری، اشتیاق برای تعالی، کارگروهی و نتیجه‌گرایی دنبال می‌کنیم. در گروه دیجی‌کالا امکانی فراهم شده تا ما با افراد با تخصص‌های متنوع در یک مجموعه فعالیت کنیم. علاوه بر این، با توجه به سرعت رشد بالا در دیجی‌کالا، امکان رشد و توسعه رو در مواجهه با چالش‌ها و استفاده از برنامه‌های توسعه و آموزش متنوع داریم.',
    city: 'تهران',
    website: 'https://www.digikala.com/',
    image: '/companies/digikala.webp',
  },
  {
    id: '116',
    name: 'خانومی',
    aboutUs:
      'فروشگاه اینترنتی خانومی به عنوان اولین فروشگاه اینترنتی تخصصی آرایشی بهداشتی در ایران، در سال 1393 راه اندازی شد و با همکاری نیروهای جوان، خلاق و کارآزموده در مدت کوتاهی به مجموعه کامل با خلق تجربه لذت بخش خرید برای مشتریان، به محبوب ترین فروشگاه تخصصی آرایشی بهداشتی و مد تبدیل شد. دسترسی به مجموعه کامل محصولات آرایشی بهداشتی، ضمانت اصالت و کیفیت تجربه خریدی بی نظیر برای مشتریان ایرانی از سراسر کشور را ایجاد می کند. خانومی نمایندگی تمامی برندهای ایرانی و بین المللی را داراست و بدون واسطه با تمامی تولیدکنندگان ایرانی و واردکنندگان رسمی برندهای خارجی همکاری می کند. فروشگاه اینترنتی خانومی در سال 1398، 1401 و 1402 موفق به دریافت نشان زرین "برند محبوب" از نگاه مصرف کنندگان شده است. پیج اینستاگرام خانومی بزرگترین و محبوب ترین شبکه اجتماعی فروشگاهی آرایشی بهداشتی در ایران است. همین تعامل مستمر با مخاطبان، باعث شده است تا خانومی همواره نیاز مخاطب را بشناسد و با تلاش در رفع نیاز مخاطب، همواره پویا و به روز باشد. خانومی معتقد است هر بانوی ایرانی باید برای حفظ نعمت ارزشمند زیبایی و سلامتی خود تلاش کند و به خاطر خودش سرزنده باشد، پیام ما برای همه بانوان ایرانی این است: #زیبا و سرزنده باش به خاطرخودت فرهنگ سازمانی خانومی، برپایه صداقت بناشده است و در یک فضای صمیمی و پویا تبادل نظر و خلق ایده به خوبی انجام می شود تا فضای رشد، یادگیری و پیشرفت برای تمامی همکاران فراهم شود.',
    city: 'تهران',
    website: 'https://www.khanoumi.com/',
    image: '/companies/khanumi.webp',
  },
  {
    id: '117',
    name: 'دکتر ساینا',
    aboutUs:
      'دکترساینا محصول شرکت دانش بنیان صنعتی نوین فناوران همراه ساینا است. چشم انداز ما کمک به بشریت برای داشتن زندگی سالم، شاد و طولانی است. هر روزه میلیون‌ها نفر در جهان برای دستیابی به خدمات پزشکی مناسب درحال چالش و تلاش هستند و دکترساینا به دنبال تغییر این مسیر است. دکتر ساینا اعتقاد دارد در عصر فناوری اطلاعات و ارتباطات، دسترسی به اطلاعات شفاف و صحیح حق همه انسان‌هاست. ما می‌خواهیم هیچ ایرانی به دلیل عدم دسترسی آسان، سریع و به صرفه یا عدم آگاهی در حوزه سلامتی، دچار غم و درد ناشی از سلامتی جسمی و روحی نباشد. ما آمده‌ایم تا با پشتوانه دانش فنی و تخصصی خود و ارتباط قوی با پزشکان تسهیلگر ارائه خدمات آنلاین با کیفیت و سریع پزشکی باشیم تا از این طریق تجربه‌ای منحصر به فرد برای آنان خلق کنیم و تا سلامتی کامل کاربران کنار آنان باشیم و به این واسطه کیفیت سلامت جامعه را افزایش دهیم.',
    city: 'تهران',
    website: 'https://www.drsaina.com/',
    image: '/companies/drsaina.webp',
  },
  {
    id: '118',
    name: 'علی بابا',
    aboutUs:
      'علی‌بابا را به سفر می‌شناسند؛ شرکتی بزرگ با 700 همکار که در کنار برندهایی مثل جاباما، دکتر نکست، سیمرغ، آوایار و...، هلدینگ گروه علی‌بابا را تشکیل می‌دهد. علی‌بابا از اولین شرکت‌هایی بود که امکان خرید و رزرو اینترنتی بلیط، هتل، تور و اقامتگاه را فراهم کرد تا همسفرِ هر سفر مسافران باشد و امروز در سکوی اول صنعت گردشگری ایران ایستاده است. دفتر مرکزی ما به اسم «روز اول» در کارخانه نوآوری آزادی قرار دارد، اما دفاتر دیگری هم در سایر مناطق تهران و شهرهای گرگان و مشهد وجود دارد.',
    city: 'تهران',
    website: 'https://www.alibaba.ir/',
    image: '/companies/alibaba.webp',
  },
];

export const positions: Job[] = [
  {
    id: '1',
    title: 'برنامه نویس دات نت',
    description:
      'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
    salary: 'توافقی',
    requiredEducationLevels: ['Master', 'Bachelor'],
    fieldOfStudy: ['نرم افزار', 'ریاضی'],
    status: 'Active',
    militaryServiceStatus: ['EducationalExemption', 'ServiceCompletionCard'],
    badges: ['جدید', 'فوری'],
    company: companies[0],
  },
  {
    id: '2',
    title: 'برنامه نویس دات نت',
    description:
      'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
    salary: 'توافقی',
    requiredEducationLevels: ['Master', 'Bachelor'],
    fieldOfStudy: ['نرم افزار', 'ریاضی'],
    status: 'Active',
    militaryServiceStatus: ['EducationalExemption', 'ServiceCompletionCard'],
    badges: ['جدید', 'فوری'],
    company: companies[1],
  },
  {
    id: '3',
    title: 'برنامه نویس دات نت',
    description:
      'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
    salary: 'توافقی',
    requiredEducationLevels: ['Master', 'Bachelor'],
    fieldOfStudy: ['نرم افزار', 'ریاضی'],
    status: 'Active',
    militaryServiceStatus: ['EducationalExemption', 'ServiceCompletionCard'],
    badges: ['جدید', 'فوری'],
    company: companies[2],
  },
  {
    id: '4',
    title: 'برنامه نویس دات نت',
    description:
      'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
    salary: 'توافقی',
    requiredEducationLevels: ['Master', 'Bachelor'],
    fieldOfStudy: ['نرم افزار', 'ریاضی'],
    status: 'Active',
    militaryServiceStatus: ['EducationalExemption', 'ServiceCompletionCard'],
    badges: ['جدید', 'فوری'],
    company: companies[3],
  },
  {
    id: '5',
    title: 'برنامه نویس دات نت',
    description:
      'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
    salary: 'توافقی',
    requiredEducationLevels: ['Master', 'Bachelor'],
    fieldOfStudy: ['نرم افزار', 'ریاضی'],
    status: 'Active',
    militaryServiceStatus: ['EducationalExemption', 'ServiceCompletionCard'],
    badges: ['جدید', 'فوری'],
    company: companies[4],
  },
];
